_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_РаспределениеПоАналитикеГрафикаДоговоров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_ГрафикДвиженийПоДоговору</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_АктПриемкиРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.УСОERP_РеализацияСтроительныхРаботВнутренняя</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетДавальцу</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ВзаимозачетЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.УСОERP_РеализацияСтроительныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПоАналитикеДоговора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокРасчетов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыКлиентом</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокДоходовРасходов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ПорядокДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СпособыКомпенсацииВозвратовТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СпособыКомпенсацииВозвратовТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаменитьТовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВернутьДенежныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОставитьВКачествеАванса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыПланированияСтроительныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыПланированияСтроительныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месячный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедельноСуточный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Импорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВвозИзЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДавальцем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПереработчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоклажедателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СХранителем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РаспределениеПоАналитикеГрафикаДоговоров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыФормы;

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура 	ПриОткрытии(Отказ)														
	
	ПараметрыФормы = СтруктураПараметрыФормы();
	ОбновитьФормуНаКлиенте();
	//
	//Если ЗначениеЗаполнено(Объект.Договор) И Не ЗначениеЗаполнено(ПараметрыФормы.ДополнительныеПараметрыПоДоговору.Ссылка) И НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Отказ = Истина;
	//	Сообщить("Ввод документа ""Распределение по аналитике графика договоров"" без дополнительных параметров по договору запрещен!");
	//КонецЕсли;
	//
	//СценарийПланирования = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(Объект.ОбъектСтроительства, Объект.Организация);
	Элементы.РаспределениеПоАналитикеДоговораЗаполнитьПоДокументуОснованию.Видимость = (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.УСОERP_АктПриемкиРабот")
	ИЛИ ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.УСОERP_РеализацияСтроительныхРабот"));

КонецПроцедуры

&НаСервере
Процедура 	ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	//Если Параметры.Свойство("ДокументОснование") И ЗначениеЗаполнено(Параметры.ДокументОснование) Тогда
	//	Объект.ДокументОснование = Параметры.ДокументОснование;
		ЗаполнитьДанныеФормыНаСервере();
	//КонецЕсли;
	//
	//Элементы.РаспределениеПоАналитикеДоговораЗаполнитьПоДокументуОснованию.Видимость = (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.УСОERP_АктПриемкиРабот")
	//ИЛИ ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.УСОERP_РеализацияСтроительныхРабот"));
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
	
	//ЗаполнитьТипСоглашения();
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипСоглашения()
	
	Если ЗначениеЗаполнено(Объект.Соглашение) Или ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Возврат;
	//  ДокументСсылка.АвансовыйОтчет
	//  ДокументСсылка.АктВыполненныхРабот
	//  ДокументСсылка.ВзаимозачетЗадолженности
	//  ДокументСсылка.ВозвратТоваровОтКлиента
	// ДокументСсылка.ЗаказКлиента 
	//ДокументСсылка.ЗаказПоставщику 
	// ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств 
	//ДокументСсылка.ОтчетДавальцу 
	// ДокументСсылка.ОтчетПереработчика 
	// ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств 
	// ДокументСсылка.ПриходныйКассовыйОрдер 
	// ДокументСсылка.РасходныйКассовыйОрдер
	// ДокументСсылка.РеализацияТоваровУслуг
	//ДокументСсылка.РеализацияУслугПрочихАктивов
	// ДокументСсылка.СписаниеБезналичныхДенежныхСредств 
	// ДокументСсылка.СписаниеЗадолженности
	//ДокументСсылка.ПриобретениеТоваровУслуг 
	// ДокументСсылка.УСОERP_АктПриемкиРабот
	//ДокументСсылка.УСОERP_РеализацияСтроительныхРабот	
	ТипОснования = ТипЗнч(Объект.ДокументОснование);
	
	Если ТипОснования = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") ИЛИ 
		ТипОснования = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") ИЛИ 
		ТипОснования = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.СоглашенияСПоставщиками");
		
	Иначе
		
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.СоглашенияСКлиентами");
		
	КонецЕсли;
	
	Элементы.Соглашение.ОграничениеТипа = ОписаниеТипа;
	
	Элементы.Соглашение.ВыбиратьТип = Ложь; 	
	
КонецПроцедуры  

&НаСервере
Процедура 	ЗаполнитьДанныеФормыНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		
		ДопПараметры = Новый Структура;
		НайтиДополнительныеПараметрыПоДоговору(ДопПараметры, Объект.Договор);
		
	КонецЕсли;
	
	СценарийПланирования = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(Объект.ОбъектСтроительства, Объект.Организация);
	
	Возврат;
	
	ДокументОснование 				= Объект.ДокументОснование;
	МетаданныеОснования 			= ДокументОснование.Метаданные();
	
	Если МетаданныеОснования.Реквизиты.Найти("Организация") <> Неопределено Тогда
		Объект.Организация 			= ДокументОснование.Организация;
	КонецЕсли;
	
	Если МетаданныеОснования.Реквизиты.Найти("Партнер") <> Неопределено Тогда 
		Объект.Партнер 				= ДокументОснование.Партнер;
	ИначеЕсли МетаданныеОснования.Реквизиты.Найти("Субподрядчик") <> Неопределено Тогда 
		Объект.Партнер 				= ДокументОснование.Субподрядчик;
	КонецЕсли;
	
	Если МетаданныеОснования.Реквизиты.Найти("Соглашение") <> Неопределено Тогда 
		Объект.Соглашение 			= ДокументОснование.Соглашение;
	КонецЕсли;
	
	Если МетаданныеОснования.Реквизиты.Найти("Контрагент") <> Неопределено Тогда 
		Объект.Контрагент 			= ДокументОснование.Контрагент;
	КонецЕсли;
	
	Если МетаданныеОснования.Реквизиты.Найти("Договор") <> Неопределено Тогда 
		Объект.Договор 				= ДокументОснование.Договор;
	КонецЕсли;
	
	Если МетаданныеОснования.Реквизиты.Найти("ДокументУтверждения") <> Неопределено Тогда 
		Объект.ДокументУтверждения 				= ДокументОснование.ДокументУтверждения;
	КонецЕсли;
	
	Если МетаданныеОснования.Реквизиты.Найти("НаправлениеДеятельности") <> Неопределено Тогда 
		Объект.НаправлениеДеятельности 				= ДокументОснование.НаправлениеДеятельности;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ДопПараметры = Новый Структура;
		НайтиДополнительныеПараметрыПоДоговору(ДопПараметры, Объект.Договор);
		Объект.ОбъектСтроительства 	= ДопПараметры.ДополнительныеПараметрыПоДоговору.Ссылка.ОбъектСтроительства;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств")
		И МетаданныеОснования.Реквизиты.Найти("ДокументОснование") <> Неопределено Тогда
		
		Если ТипЗнч(ДокументОснование.ДокументОснование) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда 
			Объект.Договор 			= ДокументОснование.ДокументОснование;
		Иначе
			МетаданныеЗаявки 		= ДокументОснование.ДокументОснование.Метаданные();
			Если МетаданныеЗаявки.Реквизиты.Найти("Договор") <> Неопределено И ЗначениеЗаполнено(ДокументОснование.ДокументОснование.Договор) Тогда
				Объект.Договор 		= ДокументОснование.ДокументОснование.Договор;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
		Если МетаданныеОснования.Реквизиты.Найти("ЗаявкаНаРасходованиеДенежныхСредств") <> Неопределено 
			И ЗначениеЗаполнено(ДокументОснование.ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование) Тогда
			
			Если ТипЗнч(ДокументОснование.ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Объект.Договор		= ДокументОснование.ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование;
			Иначе
				МетаданныеЗаявки = ДокументОснование.ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование.Метаданные();
				Если МетаданныеЗаявки.Реквизиты.Найти("Договор") <> Неопределено И ЗначениеЗаполнено(ДокументОснование.ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование.Договор) Тогда
					Объект.Договор 	= ДокументОснование.ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование.Договор;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура	ПередЗаписью(Отказ, ПараметрыЗаписи)									
	
	ПередЗаписьюНаСервере(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура 	ПередЗаписьюНаСервере(Отказ)											
	
	ИтоговаяСумма = 0;
	ТЗ_СуммаПоДокументу = Объект.РаспределениеПоАналитикеДоговора.Выгрузить(,"Сумма");
	Если ТЗ_СуммаПоДокументу.Количество() <> 0 Тогда
		ТЗ_СуммаПоДокументу.Свернуть("", "Сумма");
		ИтоговаяСумма = ТЗ_СуммаПоДокументу[0].Сумма;
	КонецЕсли;
	
	Коэффициент = 1;
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование)
		И Объект.ДокументОснование.Метаданные().Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") И 
			Объект.ДокументОснование.СпособКомпенсации = Перечисления.СпособыКомпенсацииВозвратовТоваров.ВернутьДенежныеСредства Тогда
			Коэффициент = -1;
		КонецЕсли;
		
		Если ИтоговаяСумма*Коэффициент <> Объект.ДокументОснование.СуммаДокумента Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сумма документа-основания: " + Объект.ДокументОснование + " должна соответствовать введенной сумме!" 
			+ Символы.ПС + "Сумма документа-основания: " + Объект.ДокументОснование.СуммаДокумента*Коэффициент
			+ Символы.ПС + "Сумма текущего распределения: " + ИтоговаяСумма;
			Сообщение.Сообщить();
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ДоговорПриИзменении(Элемент)											
	
	НайтиДополнительныеПараметрыПоДоговору(ПараметрыФормы, Объект.Договор);
	ПараметрыФормы.МассивТипов = МассивТиповДоговоров(Объект.Договор);
	объект.ОбъектСтроительства = ПолучитьобъектСтроительства(Объект.Договор);
	ОбновитьФормуНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура 	РаспределениеПоАналитикеДоговораПорядокРасчетовПриИзменении(Элемент)	
	
	Элементы.РаспределениеПоАналитикеДоговораПорядокДоходовРасходов.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура 	РаспределениеПоАналитикеДоговораПорядокДоходовРасходовПриИзменении(Элемент)										
	
	Элементы.РаспределениеПоАналитикеДоговораПорядокРасчетов.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура 	РаспределениеПоАналитикеДоговораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)	
	
	Элементы.РаспределениеПоАналитикеДоговораПорядокРасчетов.ТолькоПросмотр 		= Ложь;
	Элементы.РаспределениеПоАналитикеДоговораПорядокДоходовРасходов.ТолькоПросмотр 	= Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура 	РаспределениеПоАналитикеДоговораПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)			
	
	Если (Элемент.ТекущийЭлемент.Имя = "РаспределениеПоАналитикеДоговораПорядокРасчетов"
		И НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ПорядокРасчетов)) 
		ИЛИ (Элемент.ТекущийЭлемент.Имя = "РаспределениеПоАналитикеДоговораПорядокДоходовРасходов" 
		И НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ПорядокДоходовРасходов))  Тогда
		Элементы.РаспределениеПоАналитикеДоговораПорядокДоходовРасходов.ТолькоПросмотр 	= Ложь;
		Элементы.РаспределениеПоАналитикеДоговораПорядокРасчетов.ТолькоПросмотр 		= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура 	РаспределениеПоАналитикеДоговораПослеУдаления(Элемент)															
	
	Элементы.РаспределениеПоАналитикеДоговораПорядокРасчетов.ТолькоПросмотр 		= Ложь;
	Элементы.РаспределениеПоАналитикеДоговораПорядокДоходовРасходов.ТолькоПросмотр 	= Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаКлиенте
Процедура ЗаполнитьПоДокументуОснованию(Команда)
	
	Если Объект.РаспределениеПоАналитикеДоговора.Количество() <> 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьВопросПользователю", ЭтотОбъект), 
		"При автоматическом заполнении табличная часть документа будет очищена.", 
		РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		ЗаполнитьПоДокументуОснованиюНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументуОснованиюНаСервере()
	
	Объект.РаспределениеПоАналитикеДоговора.Очистить();
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ДокументОснование", Объект.ДокументОснование);
	ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);
	ПараметрыЗаполнения.Вставить("Договор", Объект.Договор);
	ПараметрыЗаполнения.Вставить("ОбъектСтроительства", Объект.ОбъектСтроительства);
	ПараметрыЗаполнения.Вставить("ДанныеРаспределения", Объект.РаспределениеПоАналитикеДоговора.Выгрузить());
	ПараметрыЗаполнения.Вставить("ДокументУтверждения",Объект.ДокументУтверждения);
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.УСОERP_АктПриемкиРабот") Тогда
		Документы.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ЗаполнитьНаОснованииАктаПриемкиРабот(ПараметрыЗаполнения);
	ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.УСОERP_РеализацияСтроительныхРабот") Тогда
		Документы.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров.ЗаполнитьНаОснованииРеализацииСтроительныхРабот(ПараметрыЗаполнения);
	КонецЕсли;
	
	Объект.РаспределениеПоАналитикеДоговора.Загрузить(ПараметрыЗаполнения.ДанныеРаспределения);
	
КонецПроцедуры

&НаКлиенте
Процедура 	ЗаполнитьВопросПользователю(РезультатВопроса, ДополнительныеПараметры) Экспорт								
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ЗаполнитьПоДокументуОснованиюНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПараметровФормы

&НаСервере
Функция 	СтруктураПараметрыФормы()												
	
	ПараметрыФормы 		= Новый Структура;
	
	
	НайтиДополнительныеПараметрыПоДоговору(ПараметрыФормы, Объект.Договор);
	
	
	МассивТипов = МассивТиповДоговоров(Объект.Договор);
	ПараметрыФормы.Вставить("МассивТипов", МассивТипов);
	
	
	ПараметрыФормы.Вставить("ВидПланирования", Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный);
	
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервереБезКонтекста
Процедура 	НайтиДополнительныеПараметрыПоДоговору(ПараметрыФормы, Договор)			
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УСОERP_ДополнительныеПараметрыПоДоговору.Ссылка КАК ДополнительныеПараметрыПоДоговору
	|ИЗ
	|	Документ.УСОERP_ДополнительныеПараметрыПоДоговору КАК УСОERP_ДополнительныеПараметрыПоДоговору
	|ГДЕ
	|	УСОERP_ДополнительныеПараметрыПоДоговору.Договор = &Договор
	|	И НЕ УСОERP_ДополнительныеПараметрыПоДоговору.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	УСОERP_ДополнительныеПараметрыПоДоговору.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДополнительныеПараметрыПоДоговору = Новый Структура;
		ДополнительныеПараметрыПоДоговору.Вставить("Ссылка", 							Выборка.ДополнительныеПараметрыПоДоговору);
		ДополнительныеПараметрыПоДоговору.Вставить("ПоВидамРабот", 						Выборка.ДополнительныеПараметрыПоДоговору.ПоВидамРабот);
		ДополнительныеПараметрыПоДоговору.Вставить("ПоРаботам", 						Выборка.ДополнительныеПараметрыПоДоговору.ПоРаботам);
		
		Если ПараметрыФормы.Свойство("ДополнительныеПараметрыПоДоговору") Тогда
			ПараметрыФормы.ДополнительныеПараметрыПоДоговору = ДополнительныеПараметрыПоДоговору;
		Иначе
			ПараметрыФормы.Вставить("ДополнительныеПараметрыПоДоговору", ДополнительныеПараметрыПоДоговору);
		КонецЕсли;
		
	Иначе
		
		ДополнительныеПараметрыПоДоговору = Новый Структура;
		ДополнительныеПараметрыПоДоговору.Вставить("Ссылка", 							Документы.УСОERP_ДополнительныеПараметрыПоДоговору.ПустаяСсылка());
		ДополнительныеПараметрыПоДоговору.Вставить("ПоВидамРабот", 						Ложь);
		ДополнительныеПараметрыПоДоговору.Вставить("ПоРаботам", 						Ложь);
		
		Если ПараметрыФормы.Свойство("ДополнительныеПараметрыПоДоговору") Тогда
			ПараметрыФормы.ДополнительныеПараметрыПоДоговору = ДополнительныеПараметрыПоДоговору;
		Иначе
			ПараметрыФормы.Вставить("ДополнительныеПараметрыПоДоговору", ДополнительныеПараметрыПоДоговору);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция		МассивТиповДоговоров(Договор)											
	
	МассивТипов = Новый Массив();   
	
	Если Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком 
		ИЛИ Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком Тогда
		МассивТипов.Добавить(Тип("ПеречислениеСсылка.ВариантыОплатыПоставщику"));
	ИначеЕсли Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем 
		ИЛИ Договор.ТипДоговора = Перечисления.ТипыДоговоров.СДавальцем Тогда
		МассивТипов.Добавить(Тип("ПеречислениеСсылка.ВариантыОплатыКлиентом"));
	КонецЕсли;
	
	Возврат МассивТипов;
	
КонецФункции

&НаСервереБезКонтекста
Функция		ПолучитьобъектСтроительства(Договор)									
	
	Возврат Договор.УСОERP_ОсновнойПроект;
	
КонецФункции

#КонецОбласти 

#Область ОбработчикиПредставленияФормы

&НаКлиенте
Процедура 	ОбновитьФормуНаКлиенте()												
	
	МассивТипов 		= ПараметрыФормы.МассивТипов;
	
	Элементы.РаспределениеПоАналитикеДоговораПорядокРасчетов.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	
	Элементы.РаспределениеПоАналитикеДоговораВидРабот.Видимость 	= ПараметрыФормы.ДополнительныеПараметрыПоДоговору.ПоВидамРабот;
	Элементы.РаспределениеПоАналитикеДоговораРабота.Видимость 		= ПараметрыФормы.ДополнительныеПараметрыПоДоговору.ПоРаботам;
	Элементы.РаспределениеПоАналитикеДоговораРаботаКодСДР.Видимость = ПараметрыФормы.ДополнительныеПараметрыПоДоговору.ПоРаботам;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)	
	
	ЗаполнитьДанныеФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент) 	
	
	ЗаполнитьДанныеФормыНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПоАналитикеДоговораРаботаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтоЭтапРаботы(ВыбранноеЗначение) Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоЭтапРаботы(Работа)
	
	Возврат Работа.СуммарнаяРабота;
	
КонецФункции

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	ПриИзмененииПартнераСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПартнераСервер() 	
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ЗаполнитьДоговорПоУмолчанию();
		//ПродажиСервер.ПартнерПриИзменении(Объект);
		
	КонецЕсли;	
	
	НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, Объект.Соглашение, Объект.Договор);
	
КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьДоговорПоУмолчанию()
	
	Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(Объект,Неопределено); 	
	
КонецПроцедуры   

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры   

#КонецОбласти
